{
  "backend/main.mo": "Defines an actor with a transform query using OutCall and a helper to perform HTTP GET requests with transformation.",
  "feature_evidence.json": "Reports feature mappings to impacted frontend files, components, and test IDs for dashboard header, CO₂ parsing, and CO₂ chart labeling changes.",
  "frontend-file-summaries.txt": "Human-written summaries describing roles of various frontend files, including pages, charts, hooks, styles, and assets.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes, chart colors, and global styling.",
  "frontend/index.html": "HTML entry point that sets the app title and loads the main React script.",
  "frontend/src/App.tsx": "Root React component that renders the TemperatureDashboardPage.",
  "frontend/src/components/CO2Chart.tsx": "Recharts-based CO₂ chart showing three percentage-series with formatted axes, tooltips, legend, and brush-based zoom sync.",
  "frontend/src/components/TemperatureChart.tsx": "Recharts temperature chart rendering filtered and CSV series with fixed °F range, tooltip formatting, legend, and zoom brush.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor tied to the current Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, stored identities, and AuthClient creation.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend query definitions.",
  "frontend/src/hooks/useSyncedTimeWindow.ts": "Hook managing shared chart zoom ranges with utilities to set, reset, and compute visible indices.",
  "frontend/src/hooks/useTemperatureSeries.ts": "React Query hook that fetches temperature data periodically and exposes loading, error, refetch, and last-updated state.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme variables, global colors, layout, and chart color tokens.",
  "frontend/src/lib/temperatureDataSource.ts": "Fetches raw JSON from a Google Apps Script endpoint and parses it into structured TemperatureDataPoint values.",
  "frontend/src/lib/temperatureParsing.ts": "Parses raw temperature/CO₂ data, normalizing numbers and timestamps, filtering invalid entries, and sorting chronologically.",
  "frontend/src/main.tsx": "App entry point initializing React Query, identity provider, global CSS, and rendering the main App component.",
  "frontend/src/pages/TemperatureDashboardPage.tsx": "Dashboard page rendering temperature and CO₂ charts with theme toggle, refresh controls, and synced time window state.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors from CSS variables, extended fonts, animations, and plugins.",
  "project_state.json": "Metadata file describing the project’s state, requirements, architecture, known issues, and feature list."
}