{
  "backend/main.mo": "Actor exposes a transform query calling OutCall.transform and a helper for performing HTTP GET outcalls.",
  "feature_evidence.json": "Feature evidence report describing CO₂ chart color updates and listing related files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten one-line summaries of multiple frontend source files for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH colors, dark mode variants, and global styling tokens.",
  "frontend/index.html": "HTML entry point defining the root container and loading the main React script.",
  "frontend/src/App.tsx": "Root React component that renders the TemperatureDashboardPage.",
  "frontend/src/components/CO2Chart.tsx": "Recharts CO₂ chart showing three CO₂ series with tooltips, legends, timestamp formatting, and brush-based range control.",
  "frontend/src/components/CoolingHeatingVentilationChart.tsx": "Chart rendering scaled Cooling, Heating, and Ventilation percentage values with synchronized range controls and formatted tooltips.",
  "frontend/src/components/DashboardCard.tsx": "Reusable card wrapper providing styled headers, titles, optional actions, and content layout for dashboard sections.",
  "frontend/src/components/FanVoltageFlowControlChart.tsx": "Chart displaying fan voltages and pressure (Pa) with dual Y-axes, formatted tooltips, and brush-based range selection.",
  "frontend/src/components/TemperatureChart.tsx": "Renders a responsive Recharts line chart for temperature data with custom tooltips, legends, and brush-based range selection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication via Internet Identity, handling identity loading, login, logout, and status tracking through React context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend canister queries; currently empty.",
  "frontend/src/hooks/useSyncedTimeWindow.ts": "Manages a zoomable time window over data, exposing the visible range and controls to set or reset it.",
  "frontend/src/hooks/useTemperatureSeries.ts": "Fetches and periodically refetches temperature data from an external source while tracking loading and update state.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light/dark mode with olive‑accented color palettes.",
  "frontend/src/lib/temperatureDataSource.ts": "Fetches raw data from a Google Apps Script endpoint and converts it into parsed temperature data points.",
  "frontend/src/lib/temperatureParsing.ts": "Parses raw temperature/CO2 data, normalizes numeric fields and timestamps, and filters out invalid entries.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/TemperatureDashboardPage.tsx": "Page component that displays temperature-related dashboards with charts, theme toggling, refresh controls, and synced time-window handling.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom fonts, colors, container settings, animations, and plugin usage.",
  "project_state.json": "Metadata describing project state, known issues, and feature requests related to adjusting CO2 chart colors."
}