{
  "kind": "build_request",
  "title": "Remove header logo entirely and revert CO₂ units/scaling to percentages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-50",
      "text": "Remove the dashboard header logo entirely so the header displays only the existing title/subtitle text block (no logo image, no logo wrapper spacing), and remove any logo-related UI in the header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "ok, doe eens ALLES van het logo weg, enkel titel. Ook alles die te maken heeft met het logo"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/TemperatureDashboardPage.tsx, the <img> logo element and its surrounding logo-only wrapper are removed from the header layout.",
        "The header still shows the title \"Conceptmachine Live Data\" and the subtitle \"data logging • Updated every 10-20 min\" with clean alignment and spacing.",
        "There is no user-facing logo-related text (e.g., no logo error/fallback messages) anywhere in the header."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Update CO₂ data parsing so that all three CO₂ series are in percent (%): keep \"CO2 CSV(%)\" in its original unit (no x10000 conversion) and manually scale \"CO2 Rechts\" and \"CO2 Links\" by multiplying each by 0.001.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "ik had je verteld dat CO2 CSV x10000 moest gedaan worden maar dat mag weer naar het originele \"CO2 CSV(%)\"",
          "CO2 Rechts mag x0.001 gedaan worden manueel",
          "CO2 Links ook x0.001",
          "alle 3 de co2 elementen staan dan in (%)"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/lib/temperatureParsing.ts, \"CO2 CSV(%)\" is parsed as a numeric percent value and is NOT multiplied by 10000.",
        "In frontend/src/lib/temperatureParsing.ts, parsed values for \"CO2 Rechts\" and \"CO2 Links\" are each multiplied by 0.001 before being stored in TemperatureDataPoint.",
        "After parsing, TemperatureDataPoint.co2Right, TemperatureDataPoint.co2Left, and TemperatureDataPoint.co2CSV all represent percentages (%).",
        "Existing timestamp parsing, numeric normalization (comma decimals), and chronological sorting behavior remains intact."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Update the CO₂ chart labels/legend/tooltip and axis labeling to reflect percentages (%), including changing the CO₂ CSV series label to \"CO2 CSV (%) - dashed\" (and removing any \"ppm\" wording).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "alle 3 de co2 elementen staan dan in (%)",
          "dat mag weer naar het originele \"CO2 CSV(%)\""
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/CO2Chart.tsx, legend and tooltip labels use percent wording (no \"ppm\" anywhere).",
        "The CO₂ CSV series is labeled exactly \"CO2 CSV (%) - dashed\" in both legend and tooltip.",
        "The Y-axis label indicates percent (e.g., includes \"(%)\") so the unit is visible on the chart."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any other immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English.",
    "Do not change the Google Apps Script endpoint URL used for fetching data."
  ],
  "nonGoals": [
    "Do not add new logo assets or replace the logo with another image.",
    "Do not change temperature chart behavior, styling, or the synced zoom/pan behavior across charts beyond what is required for the CO₂ unit changes.",
    "Do not introduce new backend canister methods or change backend behavior for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}